app/Controllers/Api/TrainingTypeController.php

SELECT COUNT(*) AS `numrows` FROM `training_type`
---
    public function dataTable()
    {
        $model = new TrainingTypeModel();
        $request = service('request');

        $draw   = $request->getVar('draw');
        $start  = $request->getVar('start');
        $length = $request->getVar('length');
        $search = $request->getVar('search')['value'] ?? '';
        $order  = $request->getVar('order');
        $columns = $request->getVar('columns');
        $filter = [
           'name' => $request->getVar('name'),
           'status =' => $request->getVar('status'),
        //    "case when is_jobseekers = 1 then 'js' when is_purna_pmi = 1 then 'pp' else '' end" => $request->getVar('group'),
        ];
        $data            = $model->getData($search, $order, $columns, $start, $length, $filter);
        $recordsFiltered = $model->countFiltered($search);
        $recordsTotal    = $model->countAll();