app/Entities/JobVacancy.php

    public function getCompany()
    {
        $companyModel = new CompanyModel();
        return $companyModel->withDeleted()->find($this->company_id);
---
SELECT *
FROM `companies`
WHERE `companies`.`id` = '1'