app/Controllers/PageController.php

SELECT *
FROM `job_vacancy`
WHERE `status` = 1
AND `id` = 15
AND `job_vacancy`.`deleted_at` IS NULL
 LIMIT 1
---
    public function index($slug): string
    {
        $page = $this->request->getPath();
        $page = $page === "" ? "lowongan-kerja" : $page;
        $data = null;
        $meta = (object)[
            'title' => 'Jariklurik ' . ($page === "" ? "" : " - ". ucfirst(str_replace("-"," ",$page))),
            'description' => 'Jariklurik - Job info menarik luar negeri sekali klik' .($page === "" ? "" : ", ". str_replace("/","",$page)),
            'keywords' => 'Jariklurik - Job info menarik luar negeri sekali klik'. ($page === "" ? "" : ", ". str_replace("/","",$page))
        ];
        if (isset($slug)) {
            $slugs = explode('-', $slug);
            $id = end($slugs);
            if (is_numeric((int)shortDecrypt($id))) {
                // dd((int)shortDecrypt($id));
                $jobVacancyModel = new JobVacancyModel();
                $data = $jobVacancyModel->where('status', 1)->where('id', (int)shortDecrypt($id))->first();