app/Models/AuthActivationAttemptModel.php

    public function findToken($payload): ?object
    {
        $result = $this->where([
            'ip_address' => $payload->ip_address,
            'user_agent' => $payload->user_agent,
        ])
            ->orderBy('id', 'DESC')
            ->first();
---
SELECT *
FROM `auth_activation_attempts`
WHERE `ip_address` = '::1'
AND `user_agent` = 'frontend-Mozilla/5.0 (iPhone; CPU iPhone OS 15_0 like Mac OS X) AppleWebKit/603.1.30 (KHTML, like Gecko) Version/17.5 Mobile/15A5370a Safari/602.1'
ORDER BY `id` DESC
 LIMIT 1