app/Models/TrainingTypeModel.php

SELECT COUNT(*) AS `numrows`
FROM `training_type`
WHERE `deleted_at` IS NULL
---
    public function countFiltered(?string $search = null): int
    {
        return $this->getDataTableQuery($search)->countAllResults();