app/Libraries/ModelService.php

SELECT *
FROM `training_type`
WHERE `quota` > quota_used
AND `status` = 1
AND `is_jobseekers` = 1
AND `training_type`.`deleted_at` IS NULL
SELECT *
FROM `settings`
WHERE `key` = 'file_statement_letter'
 LIMIT 1
---
    public function dataMaster($key, $slug): array
    {
        if ($key == 'training_type') {
            $model = new TrainingTypeModel();
            $model->where('quota > quota_used');
            if($slug == "daftar-kepelatihan" || $slug == "daftar-kepelatihan-pencari-kerja"){

                $models = $model->where("status", 1)->where("is_jobseekers", 1)->findAll();
            }
            else if($slug == "daftar-kepelatihan-purna-pmi"){
                $models = $model->where("status", 1)->where("is_purna_pmi", 1)->findAll();

            }

            return array_map(function ($item) {
                return $item->formatRefDataModel();
            }, $models);
        }
        else if ($key == 'file_sample') {
            $model = new SettingModel();
            $setting = $model->where('key', 'file_statement_letter')->first();